Repository: dev-lymar/channel-admin-bot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

# main_menu.welcome.message
source: You are in the main menu 📦 <I>Select an action below:</I>
ru: Вы находитесь в главном меню 📦 <i>Выберите нужное действие:</i>

# post.get_from_user.post_id
source: 🆔 Please enter the post ID:
ru: 🆔 Пожалуйста, введите ID поста:

# post.edit.new_title
source: 🆔 Post ID: {post_id} 🎟️ Current title: <b>{post_title}</b> <I>Enter the new title:</I>
ru: 🆔 ID поста: {post_id} 🎟️ Текущий заголовок: {post_title} <i>Введите новый заголовок:</i>

# post.error.id_not_found
source: 🆔 Post ID: {post_id} ⚠️ <b>Error:</b> No post found with this ID! 🔄 <I>Please try again.</I>
ru: 🆔 ID поста: {post_id} ⚠️ <b>Ошибка:</b> Пост с таким ID не найден! 🔄 <i>Попробуйте снова.</i>

# post.edit.new_description
source: 🆔 Post ID: {post_id} 🎟️ New title: <b>{post_title}</b> <I>Enter the new post content:</I>
ru: 🆔 ID поста: {post_id} 🎟️ Новый заголовок: {post_title} <i>Введите новый текст поста:</i>

# post.edit.new_tag
source: 🆔 Post ID: {post_id} 🎟️ New title: <b>{post_name}</b> 📔 New content: <b>{post_description}</b> <I>Enter a new tag:</I>
ru: 🆔 ID поста: {post_id} 🎟️ Новый заголовок: {post_name} 📔 Новый текст: {post_description} <i>Введите новый тег:</i>

# post.edit.new_image
source: 🆔 Post ID: {post_id} 🎟️ New title: <b>{post_name}</b> 📔 New content: <b>{post_description}</b> 🏷️ New tag: <b>{post_tag}</b> <I>Upload a new image for the post:</I>
ru: 🆔 ID поста: {post_id} 🎟️ Новый заголовок: {post_name} 📔 Новый текст: {post_description} 🏷️ Новый тег: #{post_tag} <i>Загрузите новое изображение поста:</i>

# post.edit.successfully_edited_info
source: <b>Updated post:</b> 🎟️ Title: <b>{post_name}</b> 📔 Content: <b>{post_description}</b> 🏷️ Tag: <b>#{post_tag}</b> 👤 Edited by: <b>{change_user_name}</b> 📅 Date: <b>{change_date}</b> ⏱️ Time: <b>{change_time}</b> ✅ <b>Post successfully updated!</b>
ru: <b>Измененный пост:</b> 🎟️ Заголовок: {post_name} 📔 Текст: {post_description} 🏷️ Тег: #{post_tag} 👤 Изменил: <b>{change_user_name}</b> 📅 Дата: <b>{change_date}</b> ⏱️ Время: <b>{change_time}</b> ✅ <b>Пост успешно изменен!</b>

# post.check.post_content
source: 🆔 Post ID: {post_id} 🎟️ Title: <b>{post_name}</b> 📔 Content: <b>{post_description}</b> 🏷️ Tag: <b>#{post_tag}</b>
ru: 🆔 ID поста: {post_id} 🎟️ Заголовок: {post_name} 📔 Текст: {post_description} 🏷️ Тег: #{post_tag}

# post.create.title
source: <I>Enter the title for the post:</I>
ru: <i>Введите название поста:</i>

# post.create.description
source: 🎟️ Title: <b>{post_title}</b> <I>Enter the content for the post:</I>
ru: 🎟️ Заголовок: {post_title} <i>Введите текст поста:</i>

# post.create.image
source: 🎟️ Title: <b>{post_title}</b> 📔 Content: <b>{post_description}</b> <I>Upload an image for the post:</I>
ru: 🎟️ Заголовок: {post_title} 📔 Текст: {post_description} <i>Загрузите изображение:</i>

# create.post.tag
source: 🎟️ Title: <b>{post_title}</b> 📔 Content: <b>{post_description}</b> <I>Enter a tag for the post:</I>
ru: 🎟️ Заголовок: {post_title} 📔 Текст: {post_description} <i>Введите тег:</i>

# create.post.successfully_created_info
source: 🎟️ Title: <b>{post_title}</b> 📔 Content: <b>{post_description}</b> 🏷️ Tag: <b>#{post_tag}</b> 👤 Created by: <b>{post_creator}</b> 📅 Date: <b>{post_date_creation}</b> ⏱️ Time: <b>{post_time_creation}</b> ✅ <b>Post successfully created!</b>
ru: 🎟️ Заголовок: {post_title} 📔 Текст: {post_description} 🏷️ Тег: #{post_tag} 👤 Создатель: <b>{post_creator}</b> 📅 Дата: <b>{post_date_creation}</b> ⏱️ Время: <b>{post_time_creation}</b> ✅ <b>Пост успешно создан!</b>

# user_role.role_selection
source: 🖋️ Who do you want to add?
ru: 🖋️ Кого Вы хотите добавить ?

# user_role.get_user_id
source: 🖋️ Role selected. <I>Enter the user’s ID you want to add:</I>
ru: 🖋️ Роль выбрана. <i>Введите ID пользователя, которого хотите добавить:</i>

# user_role.error.user_exists_as_admin
source: ⚠️ This user is already in the database! 👤 Role: <b>Administrator</b> 🆔 User ID: <b>{user_id}</b> 🔄 <I>Please try again.</I>
ru: ⚠️ Пользователь уже существует в базе! 👤 Роль: <b>Администратор</b> 🆔 ID: <b>{user_id}</b> 🔄 <i>Попробуйте снова.</i>

# user_role.error.user_exists_as_context_manager
source: ⚠️ This user is already in the database! 👤 Role: <b>Content Manager</b> 🆔 User ID: <b>{user_id}</b> 🔄 <I>Please try again.</I>
ru: ⚠️ Пользователь уже существует в базе! 👤 Роль: <b>Контент-менеджер</b> 🆔 ID: <b>{user_id}</b> 🔄 <i>Попробуйте снова.</i>

# user_role.error.negative_id
source: ⚠️ User ID cannot be negative! 🆔 Entered ID: <b>{user_id}</b> 🔄 <I>Please try again.</I>
ru: ⚠️ ID пользователя не может быть отрицательным! 🆔 Введенный ID: <b>{user_id}</b> 🔄 <i>Попробуйте снова.</i>

# user_role.create.get_admin_username
source: 👤 <b>Administrator</b> 🆔 Entered ID: <b>{user_id}</b> <I>Enter the username:</I>
ru: 👤 <b>Администратор</b> 🆔 Введенный ID: <b>{user_id}</b> <i>Введите имя пользователя:</i>

# user_role.error.value_error
source: ⚠️ User ID must contain <b>only numbers</b>! 🆔 Entered ID: <b>{user_id}</b> 🔄 <I>Please try again.</I>
ru: ⚠️ ID пользователя должно содержать <b>только цифры</b>! 🆔 Введенный ID: <b>{user_id}</b> 🔄 <i>Попробуйте снова.</i>

# user_role.error.invalid_username
source: ⚠️ Username cannot be a number! 🆔 User ID: <b>{user_id}</b> 🔄 <I>Please try again.</I>
ru: ⚠️ Имя пользователя не может быть числом! 🆔 ID: <b>{user_id}</b> 🔄 <i>Попробуйте снова.</i>

# user_role.create.admin_role_successfully_created
source: ✅ <b>Administrator successfully added!</b> 🆔 User ID: <b>{user_id}</b> 👤 Username: <b>{user_username}</b>
ru: ✅ <b>Администратор добавлен!</b> 🆔 ID: <b>{user_id}</b> 👤 Имя пользователя: <b>{user_username}</b>

# user_role.create.get_context_manager_username
source: 👤 <b>Content Manager</b> 🆔 Entered ID: <b>{user_id}</b> <I>Enter the username:</I>
ru: 👤 <b>Контент-менеджер</b> 🆔 Введенный ID: <b>{user_id}</b> <i>Введите имя пользователя:</i>

# user_role.create.context_manager_role_successfully_created
source: ✅ <b>Content Manager successfully added!</b> 🆔 User ID: <b>{user_id}</b> 👤 Username: <b>{user_username}</b>
ru: ✅ <b>Контент-менеджер добавлен!</b> 🆔 ID: <b>{user_id}</b> 👤 Имя пользователя: <b>{user_username}</b>

# post.delete.successfully_deleted
source: 🆔 Post ID: {post_id} 🎟️ Title: <b>{post_name}</b> ☑️ <b>Post successfully deleted!</b>
ru: 🆔 ID поста: {post_id} 🎟️ Заголовок: <b>{post_name}</b> ☑️ <b>Пост удален!</b>

# user_role.delete.get_user_id
source: ❌ Who do you want to remove? 🆔 Enter the user ID:
ru: ❌ Кого вы хотите удалить? 🆔 Введите ID пользователя:

# user_role.error.id_not_found
source: ⚠️ No user found with this ID! 🆔 Entered ID: <b>{message.text}</b> 🔄 <I>Please try again.</I>
ru: ⚠️ Пользователь с таким ID не найден в базе! 🆔 Введенный ID: <b>{message.text}</b> 🔄 <i>Попробуйте снова.</i>

# user_role.delete.successfully_deleted
source: ☑️ <b>User successfully removed!</b> 🆔 User ID: <b>{user_id}</b>
ru: ☑️ <b>Пользователь удален!</b> 🆔 ID: <b>{user_id}</b>

# post.publish.successfully_published
source: 🆔 Post ID: {post_id} 🎟️ Title: <b>{post_name}</b> 📔 Content: <b>{post_description}</b> ✅ <b>Post successfully published!</b>
ru: 🆔 ID поста: {post_id} 🎟️ Заголовок: {post_name} 📔 Текст: {post_description} ✅ <b>Пост опубликован!</b>

# start.admin.message
source: 👤 You are logged in as <b>Administrator</b> 🖲️ <I>Select an action below:</I>
ru: 👤 Вы вошли как <b>Администратор</b> 🖲️ <i>Выберите нужное действие:</i>

# start.context_manager.message
source: 👤 You are logged in as <b>Content Manager</b> 🖲️ <I>Select an action below:</I>
ru: 👤 Вы вошли как <b>Контент-менеджер</b> 🖲️ <i>Выберите нужное действие:</i>

# start.denied_access.message
source: ⚠️ Sorry, you do not have access! 🔗 <I>Please contact the administrator.</I>
ru: ⚠️ У вас нет доступа! 🔗 <i>Обратитесь к администратору.</i>

# kb.back_to_main_menu
source: 🔙 Back to main menu
ru: 🔙 Вернутся в главное меню

# kb.post.create
source: ➕ Create post
ru: ➕ Создать пост

# kb.post.edit
source: ✏️ Edit post
ru: ✏️ Редактировать пост

# kb.post.delete
source: ❌ Delete post
ru: ❌ Удалить пост

# kb.post.publish
source: 📤 Publish post
ru: 📤 Опубликовать пост

# kb.post.check
source: 🔍 View post
ru: 🔍 Найти пост

# kb.user_role.create
source: 👑 Add user role
ru: 👑 Добавить роль пользователю

# kb.user_role.delete
source: 🌂 Remove user role
ru: 🌂 Удалить роль у пользователю

# kb.select_admin_role
source: 👤 Administrator
ru: 👤 Администратор

# kb.select_context_manager_role
source: 📝 Content Manager
ru: 📝 Контент-менеджер
